In [1]:
import pandas as pd
from pandas import DataFrame
from pandas import Series
import numpy as np

In [5]:

obj = Series(np.arange(5.), index= ['a', 'b', 'c', 'd', 'e'])

In [8]:
new_obj = obj.drop('c')

In [9]:
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [10]:
obj.drop(['a', 'b'])

c    2
d    3
e    4
dtype: float64

In [11]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['Ohio', 'Colarado', 'Utah', 'New York'],
                columns=['one', 'two', 'three', 'four'])

In [12]:
data

          one  two  three  four
Ohio        0    1      2     3
Colarado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [13]:
data.drop(['Colarado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [14]:
data.drop(['two', 'three'], axis=1)

          one  four
Ohio        0     3
Colarado    4     7
Utah        8    11
New York   12    15

In [15]:
# indexing, selection, and filtering
obj = Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])

In [16]:
obj['b']

1.0

In [17]:
obj[1]

1.0

In [18]:
obj[2:4]

c    2
d    3
dtype: float64

In [19]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: float64

In [20]:
obj[[1, 3]]

b    1
d    3
dtype: float64

In [21]:
obj[obj < 2]

a    0
b    1
dtype: float64

In [22]:
obj['b':'c']

b    1
c    2
dtype: float64

In [23]:
obj['b':'c'] = 5

In [24]:
obj

a    0
b    5
c    5
d    3
dtype: float64

In [25]:
# indexing into DataFrame
data = DataFrame(np.arange(16).reshape((4,4)), index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns = ['one', 'two', 'three', 'four'])

In [27]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [28]:
data[['two', 'four']]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [32]:
data[-2:]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [34]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [37]:
data[data < 5] = 0

In [38]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
# data frame label-indexing
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [41]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [42]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [51]:
data.ix[data.two > 9]

          one  two  three  four
New York   12   13     14    15

In [55]:
# arithmetic and data alignment
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [56]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [57]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [58]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [59]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'), 
               index=['Ohio', 'Texas', 'Colorado'])

In [61]:
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
               index=['Utah', 'Ohio', 'Texas', 'Colorado'])

In [62]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [63]:
df2

          b   d   e
Utah      0   1   2
Ohio      3   4   5
Texas     6   7   8
Colorado  9  10  11

In [64]:
df1+df2

           b   c   d   e
Colorado  15 NaN  18 NaN
Ohio       3 NaN   6 NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

In [66]:
# arithmetic methods with fill values
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))

In [67]:
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [68]:
df1+df2

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [69]:
df1.add(df2, fill_value=0)

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [71]:
arr = np.arange(12.).reshape((3, 4))

In [72]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [73]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [75]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [76]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [77]:
series = frame.ix[0]

In [79]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [80]:
series

b    0
d    1
e    2
Name: Utah, dtype: float64

In [82]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [83]:
series2 = Series(range(3), index=['b', 'e', 'f'])

In [84]:
series2

b    0
e    1
f    2
dtype: int32

In [85]:
frame + series2

        b   d   e   f
Utah    0 NaN   3 NaN
Ohio    3 NaN   6 NaN
Texas   6 NaN   9 NaN
Oregon  9 NaN  12 NaN

In [86]:
series3 = frame['d']

In [87]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: float64

In [88]:
frame.sub(series3, axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [90]:
# function application and mapping

frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [91]:
frame

               b         d         e
Utah   -0.155114 -0.513693  0.096753
Ohio   -0.121128  1.282275 -2.506095
Texas  -1.005158  0.397953  0.896555
Oregon  0.214444  0.437315 -2.026176

In [92]:
f = lambda x: x.max() - x.min()

In [93]:
frame.apply(f)

b    1.219602
d    1.795968
e    3.402650
dtype: float64

In [94]:
frame.apply(f, axis=1)

Utah      0.610446
Ohio      3.788369
Texas     1.901713
Oregon    2.463491
dtype: float64

In [96]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [97]:
frame.apply(f)

            b         d         e
min -1.005158 -0.513693 -2.506095
max  0.214444  1.282275  0.896555

In [98]:
frame.apply(f, axis=1)

             min       max
Utah   -0.513693  0.096753
Ohio   -2.506095  1.282275
Texas  -1.005158  0.896555
Oregon -2.026176  0.437315

In [99]:
# applymap
format = lambda x: '%.2f' %x

In [100]:
frame.applymap(format)

            b      d      e
Utah    -0.16  -0.51   0.10
Ohio    -0.12   1.28  -2.51
Texas   -1.01   0.40   0.90
Oregon   0.21   0.44  -2.03

In [101]:
frame['e'].map(format)

Utah       0.10
Ohio      -2.51
Texas      0.90
Oregon    -2.03
Name: e, dtype: object

In [2]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [3]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [4]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index = ['three', 'one'], columns = ['d', 'a', 'b', 'c'])

In [5]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [6]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [7]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [8]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [9]:
obj

0     4
1   NaN
2     7
3   NaN
4    -3
5     2
dtype: float64

In [10]:
obj.order()

C:\Users\RHun\AppData\Local\Continuum\Miniconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [20]:
frame = DataFrame({'b': [4,7,-3,2],'a': [0,1,0,1]})

In [21]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [22]:
frame2 = {0: {'a': 0, 'b': 4}, 
          1: {'a': 1, 'b': 7}, 
          2: {'a': 0, 'b': -3},
          3: {'a': 1, 'b': 2}}

In [27]:
DataFrame(frame2).T

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [28]:
frame.sort_index(by=['a', 'b'])

C:\Users\RHun\AppData\Local\Continuum\Miniconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [29]:
obj = Series([7, -5, 4, 2, 0, 4])

In [30]:
obj.rank()

0    6.0
1    1.0
2    4.5
3    3.0
4    2.0
5    4.5
dtype: float64

In [31]:
obj.rank(method = 'first')

0    6
1    1
2    4
3    3
4    2
5    5
dtype: float64

In [32]:
obj.rank(ascending = False, method = 'max')

0    1
1    6
2    3
3    4
4    5
5    3
dtype: float64

In [34]:
frame = DataFrame({'b': [4.3, 7, -3, 2],
                  'a': [0, 1, 0, 1],
                  'c': [-2, 5, 8, -2.5]})

In [35]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [36]:
frame.rank(axis = 1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

In [37]:
frame.rank(axis=1, ascending=False, method='max')

   a  b  c
0  2  1  3
1  3  1  2
2  2  3  1
3  2  1  3

In [38]:
obj = Series(range(5), index = ['a', 'b', 'c', 'd', 'e'])

In [39]:
obj.index.is_unique

True

In [41]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [42]:
df

          0         1         2
a -0.333162  0.245068  0.242810
a  0.152795 -0.603724 -0.379941
b  1.254744  0.666337 -1.372112
b -1.359414  0.799777 -1.054367

In [43]:
df.ix['b']

          0         1         2
b  1.254744  0.666337 -1.372112
b -1.359414  0.799777 -1.054367

In [44]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], 
              index = ['a', 'b', 'c', 'd'],
              columns = ['one', 'two'])

In [45]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [46]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [47]:
df.mean(axis=1, skipana=False)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [48]:
df.idxmax()

one    b
two    d
dtype: object

In [49]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [51]:
obj = Series(['a', 'a', 'b', 'c']*4)

In [52]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [53]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [54]:
# correlation and covariance

In [55]:
import pandas.io.data as web

C:\Users\RHun\AppData\Roaming\Python\Python35\site-packages\pandas\io\data.py:33: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [57]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')
price = DataFrame({tic: data['Adj Close']
                  for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume']
                   for tic, data in all_data.items()})

In [60]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

In [62]:
price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})

In [63]:
price

                 AAPL        GOOG         IBM       MSFT
Date
2000-01-03   3.679885         NaN   90.028414  40.088751
2000-01-04   3.369633         NaN   86.972492  38.734546
2000-01-05   3.418944         NaN   90.028414  39.142957
2000-01-06   3.123074         NaN   88.476200  37.831743
2000-01-07   3.271009         NaN   88.088146  38.326135
2000-01-10   3.213479         NaN   91.580628  38.605574
2000-01-11   3.049106         NaN   92.356735  37.616790
2000-01-12   2.866242         NaN   92.744788  36.391558
2000-01-13   3.180604         NaN   91.774654  37.079408
2000-01-14   3.301829         NaN   92.841801  38.605574
2000-01-18   3.416889         NaN   89.834387  39.658845
2000-01-19   3.503185         NaN   92.744788  36.799969
2000-01-20   3.731251         NaN   92.356735  36.456044
2000-01-21   3.659339         NaN   94.297002  35.682212
2000-01-24   3.492912         NaN   94.297002  34.822400
2000-01-25   3.690159         NaN   92.453748  35.359783
2000-01-26   3.622355         NaN   90.610494  34.177541
2000-01-27   3.616191         NaN   88.088146  33.962588
2000-01-28   3.340867         NaN   86.584439  33.790625
2000-01-31   3.410725         NaN   87.118012  33.661653
2000-02-01   3.295665         NaN   85.371771  35.402773
2000-02-02   3.248408         NaN   88.088146  34.671933
2000-02-03   3.396343         NaN   90.901534  35.639222
2000-02-04   3.550442         NaN   89.737373  36.649501
2000-02-07   3.749744         NaN   88.573213  36.670997
2000-02-08   3.776454         NaN   92.308277  37.810248
2000-02-09   3.702486         NaN   91.191449  35.768194
2000-02-10   3.731251         NaN   92.551066  36.456044
2000-02-11   3.575098         NaN   89.637601  34.370999
2000-02-14   3.807274         NaN   90.171736  34.263522
...               ...         ...         ...        ...
2009-11-18  27.083298  288.037456  110.572894  25.338545
2009-11-19  26.366634  286.209296  110.046568  25.060839
2009-11-20  26.289050  284.695781  109.546120  24.926194
2009-11-23  27.072778  290.884611  110.616039  25.195484
2009-11-24  26.883422  291.254246  110.383075  25.170238
2009-11-25  26.850546  292.577910  109.822228  25.069255
2009-11-27  26.377154  289.590906  108.458940  24.589580
2009-11-30  26.287735  291.209293  109.019787  24.749472
2009-12-01  25.901131  294.640874  110.391706  25.254391
2009-12-02  25.803824  293.462046  109.761830  25.060839
2009-12-03  25.836698  292.577910  110.055199  25.102915
2009-12-04  25.421165  292.213294  109.796344  25.229145
2009-12-07  24.846519  292.832667  109.615149  25.069255
2009-12-08  24.967498  293.232260  109.408069  24.884117
2009-12-09  26.010275  294.216280  110.779981  25.001931
2009-12-10  25.830122  295.455055  111.599676  25.136577
2009-12-11  25.598686  294.960537  111.893038  25.119746
2009-12-14  25.902446  297.567930  112.108748  25.338545
2009-12-15  25.532938  296.274225  110.866270  25.262807
2009-12-16  25.646027  298.581939  111.056096  25.330129
2009-12-17  25.229178  296.673849  109.925771  24.909363
2009-12-18  25.698625  297.912594  110.365821  25.548928
2009-12-21  26.066819  299.041480  111.004314  25.683573
2009-12-22  26.346910  300.260243  112.108748  25.936032
2009-12-23  26.575717  305.534978  112.169153  26.020186
2009-12-24  27.488311  308.931613  112.660978  26.087508
2009-12-28  27.826260  311.124419  114.162311  26.230569
2009-12-29  27.496202  309.391155  113.765412  26.415706
2009-12-30  27.830205  311.054464  114.386657  26.053846
2009-12-31  27.710543  309.680858  112.945704  25.649911

[2515 rows x 4 columns]

In [64]:
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [65]:
returns = price.pct_change()

In [67]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034339  0.011117  0.004385  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

In [69]:
returns.MSFT.corr(returns.IBM)

0.49597968454928881

In [70]:
returns.MSFT.cov(returns.IBM)

0.00021595764843398285

In [71]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.410011  0.424305
GOOG  0.470676  1.000000  0.390689  0.443587
IBM   0.410011  0.390689  1.000000  0.495980
MSFT  0.424305  0.443587  0.495980  1.000000

In [72]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.001027  0.000303  0.000252  0.000309
GOOG  0.000303  0.000580  0.000142  0.000205
IBM   0.000252  0.000142  0.000367  0.000216
MSFT  0.000309  0.000205  0.000216  0.000516

In [73]:
returns.corrwith(returns.IBM)

AAPL    0.410011
GOOG    0.390689
IBM     1.000000
MSFT    0.495980
dtype: float64

In [74]:
returns.corrwith(volume)

AAPL   -0.057549
GOOG    0.062647
IBM    -0.007892
MSFT   -0.014245
dtype: float64

In [75]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [76]:
uniques = obj.unique()

In [77]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [78]:
uniques.sort()

In [79]:
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [80]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [81]:
pd.value_counts(obj.values, sort=False)

b    2
c    3
d    1
a    3
dtype: int64

In [82]:
mask = obj.isin(['b', 'c'])

In [83]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [84]:
data = DataFrame({'Qu1': [1,3,4,3,4],
                 'Qu2': [2,3,1,2,3],
                 'Qu3': [1,5,2,4,4]})

In [85]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [86]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [87]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [88]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [89]:
string_data[0] = None

In [90]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [91]:
from numpy import nan as NA

In [92]:
data = Series([1, NA, 3.5, NA, 7])

In [93]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [94]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [95]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [96]:
cleaned = data.dropna()

In [97]:
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [99]:
data.dropna(how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [100]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [101]:
df = DataFrame(np.random.randn(7, 3))

In [102]:
df

          0         1         2
0 -1.185135  0.016799  0.605608
1  1.360946  1.612616  0.291670
2 -1.140906  0.964139 -0.611067
3 -0.491572 -0.162751  0.048318
4 -0.132650 -0.869014  1.246568
5  0.533492  0.718520  0.274352
6 -0.529897  0.595350  1.633058

In [104]:
df.ix[:4, 1] = NA

In [105]:
df.ix[:2, 2] = NA

In [106]:
df.dropna(thresh = 3)

          0        1         2
5  0.533492  0.71852  0.274352
6 -0.529897  0.59535  1.633058

In [107]:
df

          0        1         2
0 -1.185135      NaN       NaN
1  1.360946      NaN       NaN
2 -1.140906      NaN       NaN
3 -0.491572      NaN  0.048318
4 -0.132650      NaN  1.246568
5  0.533492  0.71852  0.274352
6 -0.529897  0.59535  1.633058

In [108]:
df.fillna(0)

          0        1         2
0 -1.185135  0.00000  0.000000
1  1.360946  0.00000  0.000000
2 -1.140906  0.00000  0.000000
3 -0.491572  0.00000  0.048318
4 -0.132650  0.00000  1.246568
5  0.533492  0.71852  0.274352
6 -0.529897  0.59535  1.633058

In [116]:
format = lambda x: ".%2f" %x

In [119]:
df.fillna({1: 0.5, 3: -1})

          0        1         2
0 -1.185135  0.50000       NaN
1  1.360946  0.50000       NaN
2 -1.140906  0.50000       NaN
3 -0.491572  0.50000  0.048318
4 -0.132650  0.50000  1.246568
5  0.533492  0.71852  0.274352
6 -0.529897  0.59535  1.633058

In [120]:
_ = df.fillna(0, inplace = True)

In [121]:
df

          0        1         2
0 -1.185135  0.00000  0.000000
1  1.360946  0.00000  0.000000
2 -1.140906  0.00000  0.000000
3 -0.491572  0.00000  0.048318
4 -0.132650  0.00000  1.246568
5  0.533492  0.71852  0.274352
6 -0.529897  0.59535  1.633058

In [122]:
df = DataFrame(np.random.randn(6,3))

In [123]:
df

          0         1         2
0 -1.347273  1.223617 -0.828189
1 -1.063628 -0.536564  0.001345
2 -0.977785 -1.802911  0.715482
3  0.591039  0.341938 -2.813487
4  2.333016 -1.358775 -1.258265
5  0.637322 -0.373771  1.096800

In [125]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA

In [126]:
df

          0         1         2
0 -1.347273  1.223617 -0.828189
1 -1.063628 -0.536564  0.001345
2 -0.977785       NaN  0.715482
3  0.591039       NaN -2.813487
4  2.333016       NaN       NaN
5  0.637322       NaN       NaN

In [127]:
df.fillna(method = 'ffill')

          0         1         2
0 -1.347273  1.223617 -0.828189
1 -1.063628 -0.536564  0.001345
2 -0.977785 -0.536564  0.715482
3  0.591039 -0.536564 -2.813487
4  2.333016 -0.536564 -2.813487
5  0.637322 -0.536564 -2.813487

In [128]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0 -1.347273  1.223617 -0.828189
1 -1.063628 -0.536564  0.001345
2 -0.977785 -0.536564  0.715482
3  0.591039 -0.536564 -2.813487
4  2.333016       NaN -2.813487
5  0.637322       NaN -2.813487

In [129]:
data = Series([1., NA, 3.4, NA, 7])

In [131]:
data.fillna(data.mean())

0    1.0
1    3.8
2    3.4
3    3.8
4    7.0
dtype: float64

In [132]:
data = Series(np.random.randn(10), index = [['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], [1,2,3,1,2,3,1,2,2,3]])

In [133]:
data

a  1    0.875797
   2    1.169211
   3   -1.211776
b  1    1.375505
   2   -1.761526
   3    0.826046
c  1   -0.503079
   2   -1.100951
d  2    0.083374
   3   -0.428853
dtype: float64

In [134]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [135]:
data['b']

1    1.375505
2   -1.761526
3    0.826046
dtype: float64

In [138]:
data['b': 'c']

b  1    1.375505
   2   -1.761526
   3    0.826046
c  1   -0.503079
   2   -1.100951
dtype: float64

In [139]:
data.ix[['b', 'd']]

b  1    1.375505
   2   -1.761526
   3    0.826046
d  2    0.083374
   3   -0.428853
dtype: float64

In [140]:
data[:, 2]

a    1.169211
b   -1.761526
c   -1.100951
d    0.083374
dtype: float64

In [141]:
data.unstack()

          1         2         3
a  0.875797  1.169211 -1.211776
b  1.375505 -1.761526  0.826046
c -0.503079 -1.100951       NaN
d       NaN  0.083374 -0.428853

In [143]:
data.unstack().stack()

          1         2         3
a  0.875797  1.169211 -1.211776
b  1.375505 -1.761526  0.826046
c -0.503079 -1.100951       NaN
d       NaN  0.083374 -0.428853

In [146]:
frame = DataFrame(np.arange(12).reshape((4,3)), index=[['a', 'a', 'b', 'b'], [1,2,1,2]], columns = [['Ohio', 'Ohio', 'Colorado'],
                                                                                              ['Green', 'Red', 'Green']])

In [147]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [148]:
frame.index.names = ['key1', 'key2']

In [149]:
frame.columns.names = ['state', 'color']

In [150]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [151]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [156]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']], names = ['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

In [157]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [158]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [159]:
frame.swaplevel(0,1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [160]:
frame.sum(level = 'key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [161]:
frame.sum(level = 'color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [162]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1), 
                  'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                  'd': [0, 1, 2, 0, 1, 2, 3]})

In [163]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [164]:
frame2 = frame.set_index(['c', 'd'])

In [167]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [168]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [170]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [171]:
ser = Series(np.arange(3.))

In [172]:
ser

0    0
1    1
2    2
dtype: float64

In [173]:
ser[-1]

KeyError: -1

In [174]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])

In [175]:
ser2

a    0
b    1
c    2
dtype: float64

In [176]:
ser3 = Series(range(3), index=['a', 'b', 'c'])

In [177]:
ser3

a    0
b    1
c    2
dtype: int32

In [178]:
ser3[-1]

2

In [179]:
ser.ix[:1]

0    0
1    1
dtype: float64

In [180]:
ser3 = Series(range(3), index=[-5, 1, 3])

In [181]:
ser3.iget_value(2)

C:\Users\RHun\AppData\Local\Continuum\Miniconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: iget_value(i) is deprecated. Please use .iloc[i] or .iat[i]
  if __name__ == '__main__':

2

In [183]:
frame = DataFrame(np.arange(6).reshape((3,2)), index=[2,0,1])

In [184]:
frame

   0  1
2  0  1
0  2  3
1  4  5

In [185]:
frame.irow(0)

C:\Users\RHun\AppData\Local\Continuum\Miniconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: irow(i) is deprecated. Please use .iloc[i]
  if __name__ == '__main__':

0    0
1    1
Name: 2, dtype: int32

In [186]:
# panel data
import pandas.io.data as web
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk, '1/1/2009', '6/1/2012')) for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [187]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 868 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: Open to Adj Close

In [188]:
pdata = pdata.swapaxes('items', 'minor')

In [189]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 868 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT

In [190]:
pdata['Adj Close']

                 AAPL      DELL        GOOG       MSFT
Date
2009-01-02  11.933430  10.39902  160.499779  16.716321
2009-01-05  12.437067  10.26359  163.861421  16.872549
2009-01-06  12.231930  10.68922  166.863420  17.069888
2009-01-07  11.967619  10.78596  160.844427  16.042077
2009-01-08  12.189851  10.90204  162.432840  16.543649
2009-01-09  11.911075  10.75694  157.377899  16.050300
2009-01-12  11.658599  10.30228  156.189080  16.009186
2009-01-13  11.533676  10.40869  157.003261  16.296974
2009-01-14  11.220711   9.97338  150.334921  15.696732
2009-01-15  10.964291  10.19587  149.345914  15.820069
2009-01-16  10.826218   9.93469  149.685575  16.206526
2009-01-20  10.283132   9.52840  141.234014  15.195160
2009-01-21  10.891967   9.86697  151.388865  15.935184
2009-01-22  11.619150   9.65416  153.097158  14.068680
2009-01-23  11.619150   9.80893  162.188089  14.142682
2009-01-26  11.787468   9.97338  161.773501  14.496248
2009-01-27  11.930800   9.74122  165.574702  14.520916
2009-01-28  12.387098  10.52477  174.161139  14.833372
2009-01-29  12.229300   9.62514  171.488809  14.463359
2009-01-30  11.851901   9.18983  169.096191  14.060457
2009-02-02  12.033368   9.00603  170.115172  14.660698
2009-02-03  12.226670   9.45101  170.055239  15.211605
2009-02-04  12.301624   9.47036  171.328962  15.318497
2009-02-05  12.684283   9.12212  176.683613  15.655620
2009-02-06  13.112966   9.15114  185.454867  16.165414
2009-02-09  13.479845   9.32526  189.196135  15.984520
2009-02-10  12.864435   8.86093  179.076231  15.458279
2009-02-11  12.731622   8.72550  178.841472  15.795401
2009-02-12  13.053792   8.87060  181.343964  15.836515
2009-02-13  13.039327   8.82224  178.661643  15.696732
...               ...       ...         ...        ...
2012-04-23  75.177318  15.57434  298.502008  28.512527
2012-04-24  73.675617  15.65173  300.335186  28.334991
2012-04-25  80.213692  15.88390  304.555978  28.583544
2012-04-26  79.911244  15.99030  307.428105  28.503652
2012-04-27  79.293207  15.90324  307.183354  28.388252
2012-04-30  76.792114  15.83553  302.123410  28.423760
2012-05-01  76.548846  15.86455  301.913607  28.414881
2012-05-02  77.055108  15.64689  303.327209  28.228468
2012-05-03  76.508079  15.70010  305.205309  28.192961
2012-05-04  74.329161  15.29381  298.187334  27.500564
2012-05-07  74.885397  15.30348  303.472045  27.207627
2012-05-08  74.714449  15.19708  306.089446  27.074474
2012-05-09  74.845950  15.15838  304.271262  27.305273
2012-05-10  75.022151  15.04230  306.524016  27.287519
2012-05-11  74.521148  14.91654  302.313200  27.660348
2012-05-14  73.404729  14.93589  301.698816  27.234258
2012-05-15  72.740665  14.83916  305.250263  26.993008
2012-05-16  71.808347  14.52477  314.151389  26.716019
2012-05-17  69.709642  14.45222  311.214326  26.555187
2012-05-18  69.743829  14.25875  299.900615  26.153107
2012-05-21  73.807111  14.48124  306.748784  26.581993
2012-05-22  73.240361  14.58765  300.100412  26.590928
2012-05-23  75.027411  12.08221  304.426106  26.010146
2012-05-24  74.338367  12.04351  301.528978  25.974404
2012-05-25  73.939925  12.05319  295.470050  25.965469
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  75.252272  12.24666  296.873645  26.412225
2012-05-30  76.159610  12.14992  293.821674  26.215653
2012-05-31  75.970256  11.92743  290.140354  26.081627
2012-06-01  73.768977  11.67592  285.205295  25.420428

[868 rows x 4 columns]

In [191]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close     Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900   73.768977
DELL   12.150000   12.300000   12.045000   12.070000   19397600   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300   25.420428

In [192]:
pdata.ix['Adj Close', '5/22/2012':, :]

                 AAPL      DELL        GOOG       MSFT
Date
2012-05-22  73.240361  14.58765  300.100412  26.590928
2012-05-23  75.027411  12.08221  304.426106  26.010146
2012-05-24  74.338367  12.04351  301.528978  25.974404
2012-05-25  73.939925  12.05319  295.470050  25.965469
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  75.252272  12.24666  296.873645  26.412225
2012-05-30  76.159610  12.14992  293.821674  26.215653
2012-05-31  75.970256  11.92743  290.140354  26.081627
2012-06-01  73.768977  11.67592  285.205295  25.420428

In [194]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()

In [195]:
stacked

                        Open        High         Low       Close     Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400
           DELL    12.590000   12.700000   12.460000   12.560000   19787800
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600
           DELL    12.530000   12.540000   12.330000   12.330000   19955600
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900
           DELL    12.150000   12.300000   12.045000   12.070000   19397600
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300

                   Adj Close
Date       minor
2012-05-30 AAPL    76.159610
           DELL    12.149920
           GOOG   293.821674
           MSFT    26.215653
2012-05-31 AAPL    75.970256
           DELL    11.927430
           GOOG   290.140354
           MSFT    26.081627
2012-06-01 AAPL    73.768977
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.420428

In [196]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT

In [3]:
df = pd.read_csv('pydata-book-master/ch06/ex1.csv')

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
!type pydata-book-master/ch06/ex1.csv

The syntax of the command is incorrect.

In [8]:
pd.read_table('pydata-book-master/ch06/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
pd.read_csv('pydata-book-master/ch06/ex1.csv', header=None)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [10]:
pd.read_csv('pydata-book-master/ch06/ex1.csv', names = ['a', 'b', 'c', 'd', 'message'])

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [11]:
names = ['a', 'b', 'c', 'd', 'e']

In [12]:
pd.read_csv('pydata-book-master/ch06/ex1.csv', names=names, index_col='e')

         a   b   c   d
e
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [18]:
ch06 = 'pydata-book-master/ch06/'

In [19]:
parsed = pd.read_csv(ch06+'csv_mindex.csv', index_col=['key1', 'key2'])

In [20]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [22]:
list(open(ch06+'ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [23]:
result = pd.read_table(ch06+'ex3.txt', sep='\s+')

In [24]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [25]:
pd.read_csv(ch06+'ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [26]:
result = pd.read_csv(ch06+'ex5.csv')

In [27]:
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6 NaN   8   world
2     three  9  10  11  12     foo

In [28]:
pd.isnull(result)

  something      a      b      c      d message
0     False  False  False  False  False    True
1     False  False  False   True  False   False
2     False  False  False  False  False   False

In [32]:
result = pd.read_csv(ch06+'ex5.csv', na_values = ['NULL'])

In [33]:
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6 NaN   8   world
2     three  9  10  11  12     foo

In [34]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [35]:
pd.read_csv(ch06+'ex5.csv', na_values=sentinels)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6 NaN   8   world
2     three  9  10  11  12     NaN

In [38]:
result = pd.read_csv(ch06+'ex6.csv', nrows=5)

In [39]:
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [40]:
chunker = pd.read_csv(ch06+'ex6.csv', chunksize=1000)

In [41]:
chunker

In [42]:
tot = Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

In [43]:
tot = tot.order(ascending=False)

C:\Users\RHun\AppData\Local\Continuum\Miniconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

In [44]:
tot

E    368
X    364
L    346
O    343
Q    340
M    338
J    337
F    335
K    334
H    330
V    328
I    327
U    326
P    324
D    320
A    320
R    318
Y    314
G    308
S    308
N    306
W    305
T    304
B    302
Z    288
C    286
4    171
6    166
7    164
8    162
3    162
5    157
2    152
0    151
9    150
1    146
dtype: float64

In [45]:
dates = pd.date_range('1/1/2000', periods = 7)

In [46]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [47]:
ts = Series(np.arange(7), index=dates)

In [48]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [49]:
ts.to_csv(ch06+'tseries.csv')

In [51]:
Series.from_csv(ch06+'tseries.csv', parse_dates=True)

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
dtype: int64

In [52]:
import csv
f = open(ch06+'ex7.csv')
reader = csv.reader(f)

In [54]:
for line in reader: 
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [56]:
lines = list(csv.reader(open(ch06+'ex7.csv')))

In [57]:
header, values = lines[0], lines[1:]

In [60]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [61]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [63]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'

In [65]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

TypeError: "quoting" must be an integer

In [66]:
obj = """
{"name": "Wes", 
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"},
{"name": "Katie", "age": 33, "pet": "Cisco"}]}"""

In [69]:
import json
result = json.loads(obj)

In [71]:
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 25, 'name': 'Scott', 'pet': 'Zuko'},
  {'age': 33, 'name': 'Katie', 'pet': 'Cisco'}]}

In [74]:
siblings = DataFrame(result['siblings'], columns=['name', 'age'])

In [75]:
siblings

    name  age
0  Scott   25
1  Katie   33

In [78]:
from lxml.html import parse
from urllib.request import urlopen

In [82]:
parsed = parse(urlopen('http://finance.yahoo.com/q/op?s=AAPL+Options'))

In [83]:
doc = parsed.getroot()

In [84]:
doc

In [85]:
tables = doc.findall('.//table')

In [88]:
calls = tables[1]

In [90]:
puts = tables[2]

In [91]:
rows = calls.findall('.//tr')

In [94]:
def _unpack(row, kind='td'):
    elts = row.findall('.//%s' % kind)
    return [val.text_content() for val in elts]

In [95]:
_unpack(rows[0], kind='th')

['\n                \n                     Strike\n                    \n                        \ue004\n                        \ue002\n                    \n                \n                 Filter\n            ',
 'Contract Name',
 '\n                \n                    Last\n                    \n                        \ue004\n                        \ue002\n                    \n                \n            ',
 '\n                \n                    Bid\n                    \n                        \ue004\n                        \ue002\n                    \n                \n            ',
 '\n                \n                    Ask\n                    \n                        \ue004\n                        \ue002\n                    \n                \n            ',
 '\n                \n                    Change\n                    \n                        \ue004\n                        \ue002\n                    \n                \n            ',
 '\n                \n                    %Change\n                    \n                        \ue004\n                        \ue002\n                    \n                \n            ',
 '\n                \n                    Volume\n                    \n                        \ue004\n                        \ue002\n                    \n                \n            ',
 '\n                \n                    Open Interest\n                    \n                        \ue004\n                        \ue002\n                    \n                \n            ',
 '\n                \n                    Implied Volatility\n                    \n                        \ue004\n                        \ue002\n                    \n                \n            ']

In [96]:
_unpack(rows[1], kind='td')

['\n                        \n                            \n                            \n                            [modify]\n                        \n                    ']

In [120]:
from pandas.io.parsers import TextParser

def parse_options_data(table):
    rows = table.findall('.//tr')
    header = _unpack(rows[0], kind='th')
    data = [_unpack(r) for r in rows[1:]]
    return TextParser(data, names=header).get_chunk()

In [121]:
call_data = parse_options_data(calls)
pull_data = parse_options_data(puts)

In [123]:
pull_data[:10]

,Strike Filter,Contract Name,Last,Bid,Ask,Change,%Change,Volume,Open Interest,Implied Volatility
0,\n \n ...,None,NaN,NaN,NaN,NaN,None,NaN,NaN,None
1,\n 75.00\n,\n AAPL160527P00075000\n,0.01,0.00,0.01,0.00,\n \n 0.00%\n ...,100,903,\n 90.63%\n
2,\n 77.00\n,\n AAPL160527P00077000\n,0.03,0.00,0.02,0.00,\n \n 0.00%\n ...,3,39,\n 87.50%\n
3,\n 78.00\n,\n AAPL160527P00078000\n,0.07,0.03,0.04,0.00,\n \n 0.00%\n ...,16,201,\n 96.09%\n
4,\n 79.00\n,\n AAPL160527P00079000\n,0.01,0.00,0.03,0.00,\n \n 0.00%\n ...,45,83,\n 82.03%\n
5,\n 80.00\n,\n AAPL160527P00080000\n,0.01,0.00,0.01,0.00,\n \n 0.00%\n ...,5,679,\n 68.75%\n
6,\n 81.00\n,\n AAPL160527P00081000\n,0.02,0.00,0.02,0.00,\n \n 0.00%\n ...,1,515,\n 70.31%\n
7,\n 82.00\n,\n AAPL160527P00082000\n,0.03,0.00,0.01,0.00,\n \n 0.00%\n ...,19,187,\n 62.50%\n
8,\n 83.00\n,\n AAPL160527P00083000\n,0.01,0.01,0.01,-0.01,\n \n -50.00%\n ...,235,778,\n 62.50%\n
9,\n 84.00\n,\n AAPL160527P00084000\n,0.01,0.00,0.01,0.00,\n \n 0.00%\n ...,310,522,\n 53.13%\n

In [127]:
call_data[:5]

,Strike Filter,Contract Name,Last,Bid,Ask,Change,%Change,Volume,Open Interest,Implied Volatility
0,\n \n ...,None,NaN,NaN,NaN,NaN,None,NaN,NaN,None
1,\n 55.00\n,\n AAPL160527C00055000\n,41.60,42.65,42.90,0,\n \n 0.00%\n ...,1,1,\n 0.00%\n
2,\n 75.00\n,\n AAPL160527C00075000\n,15.75,15.40,15.75,0,\n \n 0.00%\n ...,12,12,\n 0.00%\n
3,\n 82.00\n,\n AAPL160527C00082000\n,11.30,13.00,13.45,0,\n \n 0.00%\n ...,2,2,\n 0.00%\n
4,\n 83.00\n,\n AAPL160527C00083000\n,10.80,12.00,12.45,0,\n \n 0.00%\n ...,1,8,\n 0.00%\n

In [142]:
from io import StringIO

In [143]:
tag = '<a href="http://www.google.com">Google</a>'

In [144]:
root = objectify.parse(StringIO(tag)).getroot()

In [145]:
root

In [146]:
frame = pd.read_csv(ch06+'ex1.csv')

In [147]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [149]:
frame.to_pickle(ch06+'frame_pickle')

In [151]:
pd.read_pickle(ch06+'frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [155]:
xls_file = pd.read_excel(ch06+'scores.xlsx')

In [156]:
xls_file

  gender         subject  score
0    boy            math     80
1   girl         science     78
2   boy          english     85
3   girl  social studies     99
4   girl         history     56

In [159]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})

In [160]:
df2 = DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})

In [161]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [162]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [163]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [164]:
pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [165]:
df3 = DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})

In [166]:
df4 = DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [167]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [168]:
pd.merge(df1, df2, on='key', how='left')

   data1 key  data2
0      0   b      1
1      1   b      1
2      2   a      0
3      3   c    NaN
4      4   a      0
5      5   a      0
6      6   b      1

In [169]:
pd.merge(df1, df2, on='key', how='outer')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0
6      3   c    NaN
7    NaN   d      2

In [171]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df2 = DataFrame({'key': ['a', 'b', 'a', 'b', 'd'], 'data2': range(5)})

In [172]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [174]:
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [175]:
pd.merge(df1, df2, on='key', how='left')

    data1 key  data2
0       0   b      1
1       0   b      3
2       1   b      1
3       1   b      3
4       2   a      0
5       2   a      2
6       3   c    NaN
7       4   a      0
8       4   a      2
9       5   b      1
10      5   b      3

In [176]:
pd.merge(df1, df2, how = 'inner')

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

In [10]:
left = DataFrame({'key1': ['foo', 'foo', 'bar'],
                 'key2': ['one', 'two', 'one'],
                 'rval': [1, 2, 3]})

In [11]:
right = DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                  'key2': ['one', 'one', 'one', 'two'],
                  'rval': [4, 5, 6, 7]})

In [180]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  rval_x  rval_y
0  foo  one       1       4
1  foo  one       1       5
2  foo  two       2     NaN
3  bar  one       3       6
4  bar  two     NaN       7

In [181]:
left

  key1 key2  rval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [182]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [183]:
pd.merge(left, right, on='key1')

  key1 key2_x  rval_x key2_y  rval_y
0  foo    one       1    one       4
1  foo    one       1    one       5
2  foo    two       2    one       4
3  foo    two       2    one       5
4  bar    one       3    one       6
5  bar    one       3    two       7

In [184]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  rval_left key2_right  rval_right
0  foo       one          1        one           4
1  foo       one          1        one           5
2  foo       two          2        one           4
3  foo       two          2        one           5
4  bar       one          3        one           6
5  bar       one          3        two           7

In [206]:
left1 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 
                  'value': range(6)})

In [207]:
right1 = DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [187]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [188]:
right1

   group_val
a        3.5
b        7.0

In [190]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [191]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [192]:
lefth = DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                  'key2': [2000, 2001, 2002, 2001, 2002],
                  'data': np.arange(5.)})

In [193]:
righth = DataFrame(np.arange(12).reshape((6, 2)), index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'],
                                                        [2001, 2000, 2000,  2000, 2001, 2002]],
                  columns=['event1', 'event2'])

In [194]:
lefth

   data    key1  key2
0     0    Ohio  2000
1     1    Ohio  2001
2     2    Ohio  2002
3     3  Nevada  2001
4     4  Nevada  2002

In [195]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [196]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

   data    key1  key2  event1  event2
0     0    Ohio  2000       4       5
0     0    Ohio  2000       6       7
1     1    Ohio  2001       8       9
2     2    Ohio  2002      10      11
3     3  Nevada  2001       0       1

In [197]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True, how='outer')

   data    key1  key2  event1  event2
0     0    Ohio  2000       4       5
0     0    Ohio  2000       6       7
1     1    Ohio  2001       8       9
2     2    Ohio  2002      10      11
3     3  Nevada  2001       0       1
4     4  Nevada  2002     NaN     NaN
4   NaN  Nevada  2000       2       3

In [208]:
left2 = DataFrame(np.arange(6).reshape((3,2)), index=['a', 'c', 'e'], columns=['Ohio', 'Nevada'])

In [199]:
left1

   Ohio  Nevada
a     0       1
c     2       3
e     4       5

In [209]:
right2 = DataFrame([[7., 8.], [9., 10.], [11., 12.], [13., 14.]], index=['b', 'c', 'd', 'e'], columns=['Missouri', 'Alabama'])

In [203]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [205]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a     0       1       NaN      NaN
b   NaN     NaN         7        8
c     2       3         9       10
d   NaN     NaN        11       12
e     4       5        13       14

In [210]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a     0       1       NaN      NaN
b   NaN     NaN         7        8
c     2       3         9       10
d   NaN     NaN        11       12
e     4       5        13       14

In [211]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [212]:
another = DataFrame([[7., 8.], [9., 10.], [11., 12], [16., 17.]],
                   index=['a', 'c', 'e', 'f'], columns=['New York', 'Oregon'])

In [213]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     0       1       NaN      NaN         7       8
c     2       3         9       10         9      10
e     4       5        13       14        11      12

In [216]:
arr = np.arange(12).reshape((3, 4))

In [217]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [215]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [13]:
s1 = Series([0, 1], index=['a', 'b'])
s2 = Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = Series([5, 6], index=['f', 'g'])

In [219]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [220]:
pd.concat([s1, s2, s3], axis=1)

    0   1   2
a   0 NaN NaN
b   1 NaN NaN
c NaN   2 NaN
d NaN   3 NaN
e NaN   4 NaN
f NaN NaN   5
g NaN NaN   6

In [14]:
s4 = pd.concat([s1*5, s3])

In [222]:
s4

a    0
b    5
f    5
g    6
dtype: int64

In [223]:
pd.concat([s1, s4], axis=1)

    0  1
a   0  0
b   1  5
f NaN  5
g NaN  6

In [224]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  5

In [225]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

    0   1
a   0   0
c NaN NaN
b   1   5
e NaN NaN

In [15]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])

In [227]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [228]:
result.unstack()

        a   b   f   g
one     0   1 NaN NaN
two     0   1 NaN NaN
three NaN NaN   5   6

In [229]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a    0  NaN    NaN
b    1  NaN    NaN
c  NaN    2    NaN
d  NaN    3    NaN
e  NaN    4    NaN
f  NaN  NaN      5
g  NaN  NaN      6

In [230]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three']).stack()

a  one      0
b  one      1
c  two      2
d  two      3
e  two      4
f  three    5
g  three    6
dtype: float64

In [231]:
df1 = DataFrame(np.arange(6).reshape((3,2)), index=['a', 'b', 'c'], columns=['one', 'two'])

In [232]:
df2 = DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'], columns=['three', 'four'])

In [233]:
df2

   three  four
a      5     6
c      7     8

In [234]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [235]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1      5    6
b      2   3    NaN  NaN
c      4   5      7    8

In [236]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1      5    6
b      2   3    NaN  NaN
c      4   5      7    8

In [238]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'], names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1      5    6
b          2   3    NaN  NaN
c          4   5      7    8

In [239]:
df1 = DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])

In [240]:
df2 = DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [241]:
df1

          a         b         c         d
0  0.676238 -0.669891 -0.259920 -1.676503
1 -0.286472  1.350262  0.239825  1.683998
2 -0.418604  0.080938 -0.517337  0.457915

In [242]:
df2

          b         d         a
0 -1.000000 -0.968604 -1.035013
1 -0.564318  1.035639  0.147688

In [244]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0  0.676238 -0.669891 -0.259920 -1.676503
1 -0.286472  1.350262  0.239825  1.683998
2 -0.418604  0.080938 -0.517337  0.457915
3 -1.035013 -1.000000       NaN -0.968604
4  0.147688 -0.564318       NaN  1.035639

In [245]:
a = Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan], index=['f', 'e', 'd', 'c', 'b', 'a'])

In [246]:
b = Series(np.arange(len(a), dtype=np.float64), index=['f', 'e', 'd', 'c', 'b', 'a'])

In [248]:
b[-1] = np.nan

In [250]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [251]:
b

f     0
e     1
d     2
c     3
b     4
a   NaN
dtype: float64

In [252]:
np.where(pd.isnull(a), b, a)

array([ 0. ,  2.5,  2. ,  3.5,  4.5,  nan])

In [253]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [254]:
df1 = DataFrame({'a': [1., np.nan, 5., np.nan], 
                'b': [np.nan, 2., np.nan, 6.],
                'c': range(2, 18, 4)})

In [255]:
df1

    a   b   c
0   1 NaN   2
1 NaN   2   6
2   5 NaN  10
3 NaN   6  14

In [256]:
df2 = DataFrame({'a': [5., 4., np.nan, 3., 7.],
                'b': [np.nan, 3., 4., 6., 8.]})

In [257]:
df2

    a   b
0   5 NaN
1   4   3
2 NaN   4
3   3   6
4   7   8

In [258]:
df1.combine_first(df2)

   a   b   c
0  1 NaN   2
1  4   2   6
2  5   4  10
3  3   6  14
4  7   8 NaN

In [3]:
s1 = Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])

In [4]:
s2 = Series([4, 5, 6], index=['c', 'd', 'e'])

In [5]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [6]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [7]:
data2.unstack()

      a   b  c  d   e
one   0   1  2  3 NaN
two NaN NaN  4  5   6

In [8]:
data2.unstack().stack(dropna=False)

one  a     0
     b     1
     c     2
     d     3
     e   NaN
two  a   NaN
     b   NaN
     c     4
     d     5
     e     6
dtype: float64

In [18]:
data = DataFrame(np.arange(6).reshape((2,3)), index=pd.Index(['Ohio', 'Colorado'], name='state'), 
                columns=pd.Index(['one', 'two', 'three'], name='number'))

In [19]:
result = data.stack()

In [22]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [27]:
df = DataFrame({'left': result, 'right': result + 5},
               columns=pd.Index(['left', 'right'], name='side'))

In [28]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [29]:
df.unstack()

side     left           right
number    one two three   one two three
state
Ohio        0   1     2     5   6     7
Colorado    3   4     5     8   9    10

In [31]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [33]:
df.unstack('state').stack('side')

state         Ohio  Colorado
number side
one    left      0         3
       right     5         8
two    left      1         4
       right     6         9
three  left      2         5
       right     7        10

In [34]:
data = DataFrame({'k1': ['one']*3 + ['two']*4,
                 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [35]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [36]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [40]:
data[data.duplicated()]

    k1  k2
1  one   1
4  two   3
6  two   4

In [41]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [42]:
data['v1'] = range(7)

In [43]:
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [44]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [45]:
data.drop_duplicates(['k1', 'k2'], take_last = True)

C:\Users\RHun\AppData\Local\Continuum\Miniconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: the take_last=True keyword is deprecated, use keep='last' instead
  if __name__ == '__main__':

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [48]:
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'pastrami', 
                           'corned beef', 'bacon', 'pastrami',
                          'honey ham', 'nova lox'], 
                  'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [49]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [54]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [55]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)

In [56]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [57]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [3]:
data = Series([1., -999., 2., -999., -1000., 3.])

In [59]:
data.replace(-999, np.nan)

0       1
1     NaN
2       2
3     NaN
4   -1000
5       3
dtype: float64

In [4]:
data.replace([-999, -1000], np.nan)

0     1
1   NaN
2     2
3   NaN
4   NaN
5     3
dtype: float64

In [5]:
data.replace([-999, -1000], [np.nan, 0])

0     1
1   NaN
2     2
3   NaN
4     0
5     3
dtype: float64

In [6]:
data.replace({-999: 0, -1000: np.nan})

0     1
1     0
2     2
3     0
4   NaN
5     3
dtype: float64

In [7]:
data = DataFrame(np.arange(12).reshape((3, 4)), index = ['Ohio', 'Colorado', 'New York'],
                columns = ['one', 'two', 'three', 'four'])

In [8]:
data.index.map(str.upper)

array(['OHIO', 'COLORADO', 'NEW YORK'], dtype=object)

In [9]:
data.index = data.index.map(str.upper)

In [10]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [11]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [12]:
_ = data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [13]:
data

          one  two  three  four
INDIANA     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [16]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [17]:
bins = [18, 25, 35, 60, 100]

In [18]:
cats = pd.cut(ages, bins)

In [19]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [20]:
cats.labels

C:\Users\RHun\AppData\Local\Continuum\Miniconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: 'labels' is deprecated. Use 'codes' instead
  if __name__ == '__main__':

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [21]:
cats.levels

C:\Users\RHun\AppData\Local\Continuum\Miniconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: Accessing 'levels' is deprecated, use 'categories'
  if __name__ == '__main__':

Index(['(18, 25]', '(25, 35]', '(35, 60]', '(60, 100]'], dtype='object')

In [22]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [23]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, object): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [24]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [25]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [28]:
data = np.random.randn(20)

In [29]:
data

array([-1.62147778, -0.44441008,  1.42216615,  1.30742549, -0.045451  ,
       -0.57633497,  0.20466963,  0.31908411, -0.81708934, -0.31505407,
        1.82778715, -0.17984488, -0.04721121,  1.70572041,  1.03537768,
        0.5631155 ,  0.095168  , -0.56905433,  0.02305982, -2.07583856])

In [30]:
pd.cut(data, 4, precision=2)

[(-2.08, -1.1], (-1.1, -0.12], (0.85, 1.83], (0.85, 1.83], (-0.12, 0.85], ..., (-0.12, 0.85], (-0.12, 0.85], (-1.1, -0.12], (-0.12, 0.85], (-2.08, -1.1]]
Length: 20
Categories (4, object): [(-2.08, -1.1] < (-1.1, -0.12] < (-0.12, 0.85] < (0.85, 1.83]]

In [32]:
data = np.random.randn(1000) # normally distributed

In [33]:
cats = pd.qcut(data, 4) # cut into quartiles

In [34]:
cats

[(0.632, 3.139], (-0.658, -0.0264], [-3.00936, -0.658], [-3.00936, -0.658], (-0.658, -0.0264], ..., [-3.00936, -0.658], [-3.00936, -0.658], [-3.00936, -0.658], (0.632, 3.139], [-3.00936, -0.658]]
Length: 1000
Categories (4, object): [[-3.00936, -0.658] < (-0.658, -0.0264] < (-0.0264, 0.632] < (0.632, 3.139]]

In [35]:
pd.value_counts(cats)

(0.632, 3.139]        250
(-0.0264, 0.632]      250
(-0.658, -0.0264]     250
[-3.00936, -0.658]    250
dtype: int64

In [37]:
stats =pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

In [38]:
pd.value_counts(stats)

(-0.0264, 1.259]      400
(-1.267, -0.0264]     400
(1.259, 3.139]        100
[-3.00936, -1.267]    100
dtype: int64

In [39]:
np.random.seed(12345)

In [40]:
data = DataFrame(np.random.randn(1000, 4))

In [43]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [44]:
col = data[3]

In [46]:
col[np.abs(col) > 3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

In [47]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [48]:
data[np.abs(data) > 3] = np.sign(data)*3

In [49]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

In [52]:
df = DataFrame(np.arange(5*4).reshape(5,4))

In [53]:
sampler = np.random.permutation(5)

In [54]:
sampler

array([1, 0, 2, 3, 4])

In [56]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [57]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [58]:
bag = np.array([5, 7, -1, 6, 4])

In [59]:
sampler = np.random.randint(0, len(bag), size=10)

In [60]:
sampler

array([2, 4, 4, 4, 4, 2, 2, 2, 0, 3])

In [61]:
draws = bag.take(sampler)

In [62]:
draws

array([-1,  4,  4,  4,  4, -1, -1, -1,  5,  6])

In [63]:
df = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [64]:
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [65]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [66]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [67]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [70]:
df_with_dummy = df[['data1']].join(dummies)

In [71]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [74]:
pd.concat([df['data1'], dummies], axis=1)

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [77]:
mnames = ['movie_id', 'title', 'genres']

In [82]:
movies = pd.read_table('pydata-book-master/ch02/movielens/movies.dat', sep='::', header=None, names=mnames)

C:\Users\RHun\AppData\Local\Continuum\Miniconda3\lib\site-packages\ipykernel\__main__.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators; you can avoid this warning by specifying engine='python'.
  if __name__ == '__main__':

In [84]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [90]:
genre_iter = (set(x.split('|')) for x in movies.genres)

In [91]:
genres = sorted(set.union(*genre_iter))

In [92]:
dummies = DataFrame(np.zeros((len(movies), len(genres))), columns=genres)

In [97]:
for i, gen in enumerate(movies.genres):
    dummies.ix[i, gen.split('|')] = 1

In [98]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [100]:
movies_windic.ix[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [101]:
values = np.random.randn(10)

In [105]:
values

array([-0.15351407,  0.01119376, -0.05055467,  0.42021107,  1.19098144,
        1.56148803, -1.132925  ,  0.09708263, -1.03157314, -0.04461798])

In [106]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [107]:
pd.get_dummies(pd.cut(values, bins))

   (0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1]
0         0           0           0           0         0
1         1           0           0           0         0
2         0           0           0           0         0
3         0           0           1           0         0
4         0           0           0           0         0
5         0           0           0           0         0
6         0           0           0           0         0
7         1           0           0           0         0
8         0           0           0           0         0
9         0           0           0           0         0

In [109]:
import re
text = "foo     bar\t baz \tqux"

In [110]:
text

'foo     bar\t baz \tqux'

In [111]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [112]:
regex = re.compile('\s+')

In [113]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [114]:
regex.findall(text)

['     ', '\t ', ' \t']

In [115]:
re.findall('\s+', text)

['     ', '\t ', ' \t']

In [116]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [117]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [118]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [119]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [120]:
m = regex.search(text)

In [121]:
m

In [122]:
print(regex.match(text))

None

In [123]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [124]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [125]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [126]:
m = regex.match('wesm@bright.net')

In [127]:
m.groups()

('wesm', 'bright', 'net')

In [128]:
m = regex.match('wesm@bright.net')

In [129]:
m.groups()

('wesm', 'bright', 'net')

In [131]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [132]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com